Repository: abdullah2310ishaq/echohabits
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ja, ko, pt, ru, zh

# appTitle
source: Eco Habit Tracker
ar: متتبع العادات البيئية
de: Öko-Gewohnheits-Tracker
es: Rastreador de Hábitos Ecológicos
fr: Suivi des Habitudes Écologiques
it: Tracciatore Abitudini Ecologiche
ja: エコ習慣トラッカー
ko: 에코 습관 추적기
pt: Rastreador de Hábitos Ecológicos
ru: Трекер Экологических Привычек
zh: 生态习惯追踪器

source: Making the world greener
ar: جعل العالم أكثر خضرة
de: Die Welt grüner machen
es: Haciendo el mundo más verde
fr: Rendre le monde plus vert
it: Rendere il mondo più verde
ja: 世界をより緑に
ko: 세상을 더 녹색으로 만들기
pt: Tornando o mundo mais verde
ru: Делаем мир зеленее
zh: 让世界更绿色

source: ECO EXPLORER
ar: مستكشف بيئي
de: ÖKO-ENTDECKER
es: EXPLORADOR ECOLÓGICO
fr: EXPLORATEUR ÉCOLOGIQUE
it: ESPLORATORE ECOLOGICO
ja: エコ探検家
ko: 에코 탐험가
pt: EXPLORADOR ECOLÓGICO
ru: ЭКО-ИССЛЕДОВАТЕЛЬ
zh: 生态探索者

source: Green Score
ar: النقاط الخضراء
de: Grüne Punktzahl
es: Puntuación Verde
fr: Score Vert
it: Punteggio Verde
ja: グリーンスコア
ko: 녹색 점수
pt: Pontuação Verde
ru: Зеленый Счет
zh: 绿色分数

# avgActionsPerDay
source: Avg Actions/Day
ar: متوسط الإجراءات/اليوم
de: Durchschn. Aktionen/Tag
es: Acciones Promedio/Día
fr: Actions Moyennes/Jour
it: Azioni Medie/Giorno
ja: 1日の平均アクション
ko: 일평균 활동
pt: Ações Médias/Dia
ru: Сред. Действий/День
zh: 平均行动/天

source: Day Streak
ar: سلسلة الأيام
de: Tages-Serie
es: Racha de Días
fr: Série de Jours
it: Serie Giornaliera
ja: 連続日数
ko: 연속 일수
pt: Sequência de Dias
ru: Серия Дней
zh: 连续天数

source: Badges
ar: شارات
de: Abzeichen
es: Insignias
it: Badge
ja: バッジ
ko: 배지
pt: Distintivos
ru: Значки
zh: 徽章

source: First Step
ar: الخطوة الأولى
de: Erster Schritt
es: Primer Paso
fr: Premier Pas
it: Primo Passo
ja: 最初の一歩
ko: 첫 걸음
pt: Primeiro Passo
ru: Первый Шаг
zh: 第一步

source: Cyclist
ar: راكب دراجة
de: Radfahrer
es: Ciclista
fr: Cycliste
it: Ciclista
ja: サイクリスト
ko: 자전거 이용자
pt: Ciclista
ru: Велосипедист
zh: 骑行者

source: Water Saver
ar: موفر المياه
de: Wassersparer
es: Ahorrador de Agua
fr: Économiseur d'Eau
it: Risparmiatore d'Acqua
ja: 節水家
ko: 절수자
pt: Economizador de Água
ru: Экономитель Воды
zh: 节水者

source: Energy Pr
ar: موفر الطاقة
de: Energie Pr
es: Energía Pr
fr: Énergie Pr
it: Energia Pr
ja: エネルギー専門家
ko: 에너지 전문가
pt: Energia Pr
ru: Энергия Пр
zh: 能源专家

source: History
ar: السجل
de: Verlauf
es: Historial
fr: Historique
it: Cronologia
ja: 履歴
ko: 기록
pt: Histórico
ru: История
zh: 历史

source: View History
ar: عرض السجل
de: Verlauf anzeigen
es: Ver Historial
fr: Voir l'Historique
it: Visualizza Cronologia
ja: 履歴を表示
ko: 기록 보기
pt: Ver Histórico
ru: Просмотр Истории
zh: 查看历史

source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
ja: 設定
ko: 설정
pt: Configurações
ru: Настройки
zh: 设置

source: Account
ar: الحساب
de: Konto
es: Cuenta
fr: Compte
ja: アカウント
ko: 계정
pt: Conta
ru: Аккаунт
zh: 账户

source: Language
ar: اللغة
de: Sprache
es: Idioma
fr: Langue
it: Lingua
ja: 言語
ko: 언어
pt: Idioma
ru: Язык
zh: 语言

source: English
ar: الإنجليزية
de: Englisch
es: Inglés
fr: Anglais
it: Inglese
ja: 英語
ko: 영어
pt: Inglês
ru: Английский
zh: 英语

source: Share App
ar: مشاركة التطبيق
de: App teilen
es: Compartir App
fr: Partager l'App
it: Condividi App
ja: アプリを共有
ko: 앱 공유
pt: Compartilhar App
ru: Поделиться Приложением
zh: 分享应用

source: Rate Us
ar: قيمنا
de: Bewerten Sie uns
es: Califícanos
fr: Notez-nous
it: Valutaci
ja: 評価する
ko: 평가하기
pt: Avalie-nos
ru: Оцените нас
zh: 评价我们

source: Support
ar: الدعم
es: Soporte
it: Supporto
ja: サポート
ko: 지원
pt: Suporte
ru: Поддержка
zh: 支持

source: Privacy Policy
ar: سياسة الخصوصية
de: Datenschutzrichtlinie
es: Política de Privacidad
fr: Politique de Confidentialité
it: Politica sulla Privacy
ja: プライバシーポリシー
ko: 개인정보 보호정책
pt: Política de Privacidade
ru: Политика Конфиденциальности
zh: 隐私政策

source: Terms of Service
ar: شروط الخدمة
de: Nutzungsbedingungen
es: Términos de Servicio
fr: Conditions d'Utilisation
it: Termini di Servizio
ja: 利用規約
ko: 서비스 약관
pt: Termos de Serviço
ru: Условия Использования
zh: 服务条款

source: Logout
ar: تسجيل الخروج
de: Abmelden
es: Cerrar Sesión
fr: Déconnexion
it: Esci
ja: ログアウト
ko: 로그아웃
pt: Sair
ru: Выйти
zh: 退出

source: Choose a Language
ar: اختر لغة
de: Sprache wählen
es: Elige un Idioma
fr: Choisir une Langue
it: Scegli una Lingua
ja: 言語を選択
ko: 언어 선택
pt: Escolha um Idioma
ru: Выберите Язык
zh: 选择语言

source: Next
ar: التالي
de: Weiter
es: Siguiente
fr: Suivant
it: Avanti
ja: 次へ
ko: 다음
pt: Próximo
ru: Далее
zh: 下一步

source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
zh: 取消

source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
de: Sind Sie sicher, dass Sie sich abmelden möchten?
es: ¿Estás seguro de que quieres cerrar sesión?
fr: Êtes-vous sûr de vouloir vous déconnecter ?
it: Sei sicuro di voler uscire?
ja: ログアウトしてもよろしいですか？
ko: 로그아웃하시겠습니까?
pt: Tem certeza de que deseja sair?
ru: Вы уверены, что хотите выйти?
zh: 您确定要退出吗？

source: Account settings coming soon
ar: إعدادات الحساب قريباً
de: Kontoeinstellungen kommen bald
es: Configuración de cuenta próximamente
fr: Paramètres de compte à venir
it: Impostazioni account in arrivo
ja: アカウント設定は近日公開
ko: 계정 설정 곧 출시
pt: Configurações de conta em breve
ru: Настройки аккаунта скоро
zh: 账户设置即将推出

# languageChangedTo
source: Language changed to {language}
ar: تم تغيير اللغة إلى {language}
de: Sprache geändert zu {language}
es: Idioma cambiado a {language}
fr: Langue changée en {language}
it: Lingua cambiata in {language}
ja: 言語が {language} に変更されました
ko: 언어가 {language}(으)로 변경되었습니다
pt: Idioma alterado para {language}
ru: Язык изменен на {language}
zh: 语言已更改为 {language}

source: Share functionality coming soon
ar: ميزة المشاركة قريباً
de: Teilen-Funktion kommt bald
es: Funcionalidad de compartir próximamente
fr: Fonctionnalité de partage à venir
it: Funzionalità di condivisione in arrivo
ja: 共有機能は近日公開
ko: 공유 기능 곧 출시
pt: Funcionalidade de compartilhamento em breve
ru: Функция обмена скоро
zh: 分享功能即将推出

source: Logout functionality coming soon
ar: ميزة تسجيل الخروج قريباً
de: Abmelde-Funktion kommt bald
es: Funcionalidad de cerrar sesión próximamente
fr: Fonctionnalité de déconnexion à venir
it: Funzionalità di logout in arrivo
ja: ログアウト機能は近日公開
ko: 로그아웃 기능 곧 출시
pt: Funcionalidade de saída em breve
ru: Функция выхода скоро
zh: 退出功能即将推出

source: Could not open link
ar: تعذر فتح الرابط
de: Link konnte nicht geöffnet werden
es: No se pudo abrir el enlace
fr: Impossible d'ouvrir le lien
it: Impossibile aprire il link
ja: リンクを開けませんでした
ko: 링크를 열 수 없습니다
pt: Não foi possível abrir o link
ru: Не удалось открыть ссылку
zh: 无法打开链接

# habitLibrary
source: Habit
ar: العادات
de: Gewohnheit
es: Hábito
fr: Habitude
it: Abitudine
ja: 習慣
ko: 습관
pt: Biblioteca de Hábitos
ru: Библиотека Привычек
zh: 习惯

source: Pick one habit to begin your eco journey.
ar: اختر عادة واحدة لبدء رحلتك البيئية.
de: Wählen Sie eine Gewohnheit, um Ihre Öko-Reise zu beginnen.
es: Elige un hábito para comenzar tu viaje ecológico.
fr: Choisissez une habitude pour commencer votre voyage écologique.
it: Scegli un'abitudine per iniziare il tuo viaggio ecologico.
ja: エコの旅を始めるために1つの習慣を選んでください。
ko: 에코 여정을 시작하려면 하나의 습관을 선택하세요.
pt: Escolha um hábito para começar sua jornada ecológica.
ru: Выберите одну привычку, чтобы начать ваше экологическое путешествие.
zh: 选择一个习惯开始您的生态之旅。

source: Pick a Habit to Add
ar: اختر عادة للإضافة
de: Gewohnheit zum Hinzufügen wählen
es: Elige un Hábito para Agregar
fr: Choisir une Habitude à Ajouter
it: Scegli un'Abitudine da Aggiungere
ja: 追加する習慣を選択
ko: 추가할 습관 선택
pt: Escolha um Hábito para Adicionar
ru: Выберите Привычку для Добавления
zh: 选择要添加的习惯

source: All
ar: الكل
de: Alle
es: Todos
fr: Tous
it: Tutti
ja: すべて
ko: 전체
pt: Todos
ru: Все
zh: 全部

source: Transport
ar: المواصلات
es: Transporte
it: Trasporto
ja: 交通
ko: 교통
pt: Transporte
ru: Транспорт
zh: 交通

source: Food
ar: الطعام
de: Essen
es: Comida
fr: Alimentation
it: Cibo
ja: 食べ物
ko: 음식
pt: Comida
ru: Еда
zh: 食物

source: Home
ar: المنزل
de: Zuhause
es: Hogar
fr: Maison
it: Casa
ja: 家庭
ko: 가정
pt: Casa
ru: Дом
zh: 家庭

source: Water
ar: المياه
de: Wasser
es: Agua
fr: Eau
it: Acqua
ja: 水
ko: 물
pt: Água
ru: Вода
zh: 水

source: Shopping
ar: التسوق
de: Einkaufen
es: Compras
ja: ショッピング
ko: 쇼핑
pt: Compras
ru: Покупки
zh: 购物

source: Waste
ar: النفايات
de: Abfall
es: Residuos
fr: Déchets
it: Rifiuti
ja: 廃棄物
ko: 폐기물
pt: Resíduos
ru: Отходы
zh: 废物

source: Digital
ar: الرقمي
fr: Numérique
it: Digitale
ja: デジタル
ko: 디지털
ru: Цифровое
zh: 数字

source: Fitness
ar: اللياقة البدنية
ja: フィットネス
ko: 피트니스
ru: Фитнес
zh: 健身

source: Mindfulness
ar: اليقظة
de: Achtsamkeit
es: Atención Plena
fr: Pleine Conscience
it: Consapevolezza
ja: マインドフルネス
ko: 마음챙김
pt: Atenção Plena
ru: Осознанность
zh: 正念

source: Savings
ar: التوفير
de: Ersparnisse
es: Ahorros
fr: Épargne
it: Risparmi
ja: 貯蓄
ko: 저축
pt: Economias
ru: Сбережения
zh: 储蓄

source: Easy
ar: سهل
de: Einfach
es: Fácil
fr: Facile
it: Facile
ja: 簡単
ko: 쉬움
pt: Fácil
ru: Легко
zh: 简单

source: Medium
ar: متوسط
de: Mittel
es: Medio
fr: Moyen
it: Medio
ja: 中程度
ko: 보통
pt: Médio
ru: Средне
zh: 中等

source: High Impact
ar: تأثير عالي
de: Hohe Wirkung
es: Alto Impacto
fr: Impact Élevé
it: Alto Impatto
ja: 高い影響
ko: 높은 영향
pt: Alto Impacto
ru: Высокое Воздействие
zh: 高影响

source: Medium Impact
ar: تأثير متوسط
de: Mittlere Wirkung
es: Impacto Medio
fr: Impact Moyen
it: Impatto Medio
ja: 中程度の影響
ko: 중간 영향
pt: Impacto Médio
ru: Среднее Воздействие
zh: 中等影响

source: Low Impact
ar: تأثير منخفض
de: Geringe Wirkung
es: Bajo Impacto
fr: Impact Faible
it: Basso Impatto
ja: 低い影響
ko: 낮은 영향
pt: Baixo Impacto
ru: Низкое Воздействие
zh: 低影响

# monday
source: Mon
ar: الاثنين
de: Mo
es: Lun
fr: Lun
it: Lun
ja: 月
ko: 월
pt: Seg
ru: Пн
zh: 周一

# tuesday
source: Tue
ar: الثلاثاء
de: Di
es: Mar
fr: Mar
it: Mar
ja: 火
ko: 화
pt: Ter
ru: Вт
zh: 周二

# wednesday
source: Wed
ar: الأربعاء
de: Mi
es: Mié
fr: Mer
it: Mer
ja: 水
ko: 수
pt: Qua
ru: Ср
zh: 周三

# thursday
source: Thu
ar: الخميس
de: Do
es: Jue
fr: Jeu
it: Gio
ja: 木
ko: 목
pt: Qui
ru: Чт
zh: 周四

# friday
source: Fri
ar: الجمعة
de: Fr
es: Vie
fr: Ven
it: Ven
ja: 金
ko: 금
pt: Sex
ru: Пт
zh: 周五

# saturday
source: Sat
ar: السبت
de: Sa
es: Sáb
fr: Sam
it: Sab
ja: 土
ko: 토
pt: Sáb
ru: Сб
zh: 周六

# sunday
source: Sun
ar: الأحد
de: So
es: Dom
fr: Dim
it: Dom
ja: 日
ko: 일
pt: Dom
ru: Вс
zh: 周日

# setUpYourProfile
source: Profile
ar: الملف الشخصي
de: Profil
es: Perfil
fr: Profil
it: Profilo
ja: プロフィール
ko: 프로필
pt: Configure seu perfil
ru: Настройте свой профиль
zh: 个人资料

source: Let's personalize your eco journey
ar: دعنا نخصص رحلتك البيئية
de: Personalisieren wir Ihre Öko-Reise
es: Personalicemos tu viaje ecológico
fr: Personnalisons votre voyage écologique
it: Personalizziamo il tuo viaggio ecologico
ja: エコの旅をパーソナライズしましょう
ko: 에코 여정을 개인화해보세요
pt: Vamos personalizar sua jornada ecológica
ru: Давайте персонализируем ваше экологическое путешествие
zh: 让我们个性化您的生态之旅

source: Tap to upload photo
ar: اضغط لرفع الصورة
de: Tippen zum Hochladen eines Fotos
es: Toca para subir foto
fr: Appuyez pour télécharger une photo
it: Tocca per caricare una foto
ja: タップして写真をアップロード
ko: 탭하여 사진 업로드
pt: Toque para fazer upload de foto
ru: Нажмите, чтобы загрузить фото
zh: 点击上传照片

source: Your Name
ar: اسمك
de: Ihr Name
es: Tu Nombre
fr: Votre Nom
it: Il Tuo Nome
ja: お名前
ko: 이름
pt: Seu Nome
ru: Ваше Имя
zh: 您的姓名

# nameHint
source: e.g. Liza
ar: مثال: ليلى
de: z.B. Liza
es: ej. Liza
fr: ex. Liza
it: es. Liza
ja: 例：Liza
ko: 예: Liza
pt: ex. Liza
ru: напр. Лиза
zh: 例如：Liza

# continueButton
source: Continue
ar: متابعة
de: Weiter
es: Continuar
fr: Continuer
it: Continua
ja: 続ける
ko: 계속
pt: Continuar
ru: Продолжить
zh: 继续

source: Please enter your name
ar: الرجاء إدخال اسمك
de: Bitte geben Sie Ihren Namen ein
es: Por favor ingresa tu nombre
fr: Veuillez entrer votre nom
it: Inserisci il tuo nome
ja: お名前を入力してください
ko: 이름을 입력해주세요
pt: Por favor, insira seu nome
ru: Пожалуйста, введите ваше имя
zh: 请输入您的姓名

# errorPickingImage
source: Error picking image: {error}
ar: خطأ في اختيار الصورة: {error}
de: Fehler beim Auswählen des Bildes: {error}
es: Error al seleccionar imagen: {error}
fr: Erreur lors de la sélection de l'image : {error}
it: Errore nella selezione dell'immagine: {error}
ja: 画像の選択エラー：{error}
ko: 이미지 선택 오류: {error}
pt: Erro ao selecionar imagem: {error}
ru: Ошибка при выборе изображения: {error}
zh: 选择图片时出错：{error}

source: Choose from Gallery
ar: اختر من المعرض
de: Aus Galerie wählen
es: Elegir de la Galería
fr: Choisir dans la Galerie
it: Scegli dalla Galleria
ja: ギャラリーから選択
ko: 갤러리에서 선택
pt: Escolher da Galeria
ru: Выбрать из Галереи
zh: 从图库选择

source: Take a Photo
ar: التقط صورة
de: Foto aufnehmen
es: Tomar una Foto
fr: Prendre une Photo
it: Scatta una Foto
ja: 写真を撮る
ko: 사진 촬영
pt: Tirar uma Foto
ru: Сделать Фото
zh: 拍照

source: Use Default Image
ar: استخدم الصورة الافتراضية
de: Standardbild verwenden
es: Usar Imagen Predeterminada
fr: Utiliser l'Image par Défaut
it: Usa Immagine Predefinita
ja: デフォルト画像を使用
ko: 기본 이미지 사용
pt: Usar Imagem Padrão
ru: Использовать Изображение по Умолчанию
zh: 使用默认图片

source: Leaderboard
ar: لوحة المتصدرين
de: Bestenliste
es: Clasificación
fr: Classement
it: Classifica
ja: リーダーボード
ko: 리더보드
pt: Classificação
ru: Таблица Лидеров
zh: 排行榜

source: Your eco habits, your rank
ar: عاداتك البيئية، مرتبتك
de: Ihre Öko-Gewohnheiten, Ihr Rang
es: Tus hábitos ecológicos, tu rango
fr: Vos habitudes écologiques, votre rang
it: Le tue abitudini ecologiche, il tuo rango
ja: あなたのエコ習慣、あなたのランク
ko: 당신의 에코 습관, 당신의 순위
pt: Seus hábitos ecológicos, sua classificação
ru: Ваши экологические привычки, ваш ранг
zh: 您的生态习惯，您的排名

# betterHabitsLeadToBetterBadges
source: Better habits lead to better badges and greater progress.
ar: العادات الأفضل تؤدي إلى شارات أفضل وتقدم أكبر.
de: Bessere Gewohnheiten führen zu besseren Abzeichen und größerem Fortschritt.
es: Mejores hábitos conducen a mejores insignias y mayor progreso.
fr: De meilleures habitudes mènent à de meilleurs badges et à plus de progrès.
it: Abitudini migliori portano a badge migliori e maggiori progressi.
ja: より良い習慣がより良いバッジとより大きな進歩につながります。
ko: 더 나은 습관이 더 나은 배지와 더 큰 진전으로 이어집니다.
pt: Melhores hábitos levam a melhores distintivos e maior progresso.
ru: Лучшие привычки ведут к лучшим значкам и большему прогрессу.
zh: 更好的习惯带来更好的徽章和更大的进步。

source: Current eco habit rankings
ar: تصنيفات العادات البيئية الحالية
de: Aktuelle Öko-Gewohnheits-Rangliste
es: Clasificaciones actuales de hábitos ecológicos
fr: Classements actuels des habitudes écologiques
it: Classifiche attuali delle abitudini ecologiche
ja: 現在のエコ習慣ランキング
ko: 현재 에코 습관 순위
pt: Classificações atuais de hábitos ecológicos
ru: Текущие рейтинги экологических привычек
zh: 当前生态习惯排名

source: You
ar: أنت
de: Sie
es: Tú
fr: Vous
it: Tu
ja: あなた
ko: 당신
pt: Você
ru: Вы
zh: 您

source: Green Starter
ar: مبتدئ أخضر
de: Grüner Anfänger
es: Iniciador Verde
fr: Débutant Vert
it: Principiante Verde
ja: グリーンスターター
ko: 녹색 초보자
pt: Iniciante Verde
ru: Зеленый Новичок
zh: 绿色新手

# ecoExplorerRank
source: Eco Explorer
ar: مستكشف بيئي
de: Öko-Entdecker
es: Explorador Ecológico
fr: Explorateur Écologique
it: Esploratore Ecologico
ja: エコ探検家
ko: 에코 탐험가
pt: Explorador Ecológico
ru: Эко-Исследователь
zh: 生态探索者

source: Eco Warrior
ar: محارب بيئي
de: Öko-Krieger
es: Guerrero Ecológico
fr: Guerrier Écologique
it: Guerriero Ecologico
ja: エコ戦士
ko: 에코 전사
pt: Guerreiro Ecológico
ru: Эко-Воин
zh: 生态战士

source: Nature Guardian
ar: حارس الطبيعة
de: Naturwächter
es: Guardián de la Naturaleza
fr: Gardien de la Nature
it: Guardiano della Natura
ja: 自然の守護者
ko: 자연 수호자
pt: Guardião da Natureza
ru: Хранитель Природы
zh: 自然守护者

source: Eco Master
ar: سيد بيئي
de: Öko-Meister
es: Maestro Ecológico
fr: Maître Écologique
it: Maestro Ecologico
ja: エコマスター
ko: 에코 마스터
pt: Mestre Ecológico
ru: Эко-Мастер
zh: 生态大师

source: Hi
ar: مرحباً
de: Hallo
es: Hola
fr: Salut
it: Ciao
ja: こんにちは
ko: 안녕하세요
pt: Olá
ru: Привет
zh: 你好

source: Daily Eco Score
ar: النقاط البيئية اليومية
de: Tägliche Öko-Punktzahl
es: Puntuación Ecológica Diaria
fr: Score Écologique Quotidien
it: Punteggio Ecologico Giornaliero
ja: 毎日のエコスコア
ko: 일일 에코 점수
pt: Pontuação Ecológica Diária
ru: Ежедневный Экологический Счет
zh: 每日生态分数

# nextLevel
source: Next Level: {level}
ar: المستوى التالي: {level}
de: Nächstes Level: {level}
es: Siguiente Nivel: {level}
fr: Niveau Suivant : {level}
it: Prossimo Livello: {level}
ja: 次のレベル：{level}
ko: 다음 레벨: {level}
pt: Próximo Nível: {level}
ru: Следующий Уровень: {level}
zh: 下一级：{level}

source: Today's Eco Tasks
ar: مهام اليوم البيئية
de: Heutige Öko-Aufgaben
es: Tareas Ecológicas de Hoy
fr: Tâches Écologiques d'Aujourd'hui
it: Compiti Ecologici di Oggi
ja: 今日のエコタスク
ko: 오늘의 에코 작업
pt: Tarefas Ecológicas de Hoje
ru: Экологические Задачи Сегодня
zh: 今日生态任务

source: Skipped! Your streak needs consistency
ar: تم التخطي! سلسلتك تحتاج إلى الاتساق
de: Übersprungen! Ihre Serie braucht Konsistenz
es: ¡Omitido! Tu racha necesita consistencia
fr: Ignoré ! Votre série a besoin de cohérence
it: Saltato! La tua serie ha bisogno di coerenza
ja: スキップ！連続記録には一貫性が必要です
ko: 건너뜀! 연속 기록에는 일관성이 필요합니다
pt: Ignorado! Sua sequência precisa de consistência
ru: Пропущено! Вашей серии нужна последовательность
zh: 已跳过！您的连续记录需要一致性

source: {task} Done! Streak Strong
ar: {task} تم! السلسلة قوية
de: {task} Erledigt! Serie Stark
es: {task} ¡Hecho! Racha Fuerte
fr: {task} Fait ! Série Forte
it: {task} Fatto! Serie Forte
ja: {task} 完了！連続記録が強い
ko: {task} 완료! 연속 기록 강함
pt: {task} Feito! Sequência Forte
ru: {task} Сделано! Серия Сильна
zh: {task} 完成！连续记录强劲

source: {task} Done
ar: {task} تم
de: {task} Erledigt
es: {task} Hecho
fr: {task} Fait
it: {task} Fatto
ja: {task} 完了
ko: {task} 완료
pt: {task} Feito
ru: {task} Сделано
zh: {task} 完成

source: Skip
ar: تخطي
de: Überspringen
es: Omitir
fr: Ignorer
it: Salta
ja: スキップ
ko: 건너뛰기
pt: Ignorar
ru: Пропустить
zh: 跳过

source: Done
ar: تم
de: Erledigt
es: Hecho
fr: Fait
it: Fatto
ja: 完了
ko: 완료
pt: Feito
ru: Готово
zh: 完成

source: No more tasks for the day
ar: لا مزيد من المهام لهذا اليوم
de: Keine weiteren Aufgaben für heute
es: No hay más tareas para el día
fr: Plus de tâches pour aujourd'hui
it: Nessun altro compito per oggi
ja: 今日のタスクはこれ以上ありません
ko: 오늘 더 이상 작업이 없습니다
pt: Não há mais tarefas para hoje
ru: Больше нет задач на сегодня
zh: 今天没有更多任务了

source: Good Morning
ar: صباح الخير
de: Guten Morgen
es: Buenos Días
fr: Bonjour
it: Buongiorno
ja: おはようございます
ko: 좋은 아침
pt: Bom Dia
ru: Доброе Утро
zh: 早上好

source: Good Afternoon
ar: مساء الخير
de: Guten Tag
es: Buenas Tardes
fr: Bon Après-midi
it: Buon Pomeriggio
ja: こんにちは
ko: 좋은 오후
pt: Boa Tarde
ru: Добрый День
zh: 下午好

source: Good Evening
ar: مساء الخير
de: Guten Abend
es: Buenas Noches
fr: Bonsoir
it: Buonasera
ja: こんばんは
ko: 좋은 저녁
pt: Boa Noite
ru: Добрый Вечер
zh: 晚上好

# thisHabitIsAlreadyAdded
source: This habit is already added to your list
ar: هذه العادة مضافة بالفعل إلى قائمتك
de: Diese Gewohnheit ist bereits zu Ihrer Liste hinzugefügt
es: Este hábito ya está agregado a tu lista
fr: Cette habitude est déjà ajoutée à votre liste
it: Questa abitudine è già stata aggiunta alla tua lista
ja: この習慣は既にリストに追加されています
ko: 이 습관은 이미 목록에 추가되었습니다
pt: Este hábito já foi adicionado à sua lista
ru: Эта привычка уже добавлена в ваш список
zh: 此习惯已添加到您的列表中

# thisHabitWasAddedRecently
source: This habit was added recently. Please wait {hours} hours before adding again (resets at midnight)
ar: تمت إضافة هذه العادة مؤخراً. يرجى الانتظار {hours} ساعة قبل الإضافة مرة أخرى (يعيد التعيين عند منتصف الليل)
de: Diese Gewohnheit wurde kürzlich hinzugefügt. Bitte warten Sie {hours} Stunden, bevor Sie sie erneut hinzufügen (setzt sich um Mitternacht zurück)
es: Este hábito se agregó recientemente. Por favor espera {hours} horas antes de agregarlo nuevamente (se reinicia a medianoche)
fr: Cette habitude a été ajoutée récemment. Veuillez attendre {hours} heures avant de l'ajouter à nouveau (se réinitialise à minuit)
it: Questa abitudine è stata aggiunta di recente. Attendi {hours} ore prima di aggiungerla di nuovo (si resetta a mezzanotte)
ja: この習慣は最近追加されました。再度追加する前に {hours} 時間お待ちください（深夜にリセット）
ko: 이 습관은 최근에 추가되었습니다. 다시 추가하기 전에 {hours}시간 기다려주세요 (자정에 재설정)
pt: Este hábito foi adicionado recentemente. Aguarde {hours} horas antes de adicionar novamente (reinicia à meia-noite)
ru: Эта привычка была добавлена недавно. Пожалуйста, подождите {hours} часов перед повторным добавлением (сбрасывается в полночь)
zh: 此习惯最近已添加。请等待 {hours} 小时后再添加（午夜重置）

source: {habit} Added! Keep Going
ar: {habit} تمت الإضافة! استمر
de: {habit} Hinzugefügt! Weiter so
es: {habit} ¡Agregado! Sigue Adelante
fr: {habit} Ajouté ! Continuez
it: {habit} Aggiunto! Continua
ja: {habit} 追加されました！続けましょう
ko: {habit} 추가됨! 계속하세요
pt: {habit} Adicionado! Continue
ru: {habit} Добавлено! Продолжайте
zh: {habit} 已添加！继续努力

source: Cycle to work
ar: الدراجة إلى العمل
de: Mit dem Fahrrad zur Arbeit
es: Ir en bicicleta al trabajo
fr: Aller au travail à vélo
it: Andare al lavoro in bicicletta
ja: 自転車で通勤
ko: 자전거로 출퇴근
pt: Ir de bicicleta para o trabalho
ru: Ездить на работу на велосипеде
zh: 骑自行车上班

source: Use public transport
ar: استخدم وسائل النقل العامة
de: Öffentliche Verkehrsmittel nutzen
es: Usar transporte público
fr: Utiliser les transports publics
it: Usare i trasporti pubblici
ja: 公共交通機関を利用
ko: 대중교통 이용
pt: Usar transporte público
ru: Использовать общественный транспорт
zh: 使用公共交通工具

source: Carpool with colleagues
ar: شارك السيارات مع الزملاء
de: Fahrgemeinschaft mit Kollegen
es: Compartir coche con colegas
fr: Covoiturage avec collègues
it: Condividere l'auto con i colleghi
ja: 同僚と相乗り
ko: 동료와 카풀
pt: Compartilhar carona com colegas
ru: Ездить на работу с коллегами
zh: 与同事拼车

source: Walk short distances
ar: امشِ للمسافات القصيرة
de: Kurze Strecken zu Fuß gehen
es: Caminar distancias cortas
fr: Marcher sur de courtes distances
it: Camminare per brevi distanze
ja: 短距離を歩く
ko: 짧은 거리 걷기
pt: Caminhar distâncias curtas
ru: Ходить пешком на короткие расстояния
zh: 短距离步行

source: Maintain bike regularly
ar: صيانة الدراجة بانتظام
de: Fahrrad regelmäßig warten
es: Mantener la bicicleta regularmente
fr: Entretenir régulièrement le vélo
it: Manutenere regolarmente la bicicletta
ja: 自転車を定期的にメンテナンス
ko: 자전거 정기 점검
pt: Manter a bicicleta regularmente
ru: Регулярно обслуживать велосипед
zh: 定期维护自行车

source: Buy bulk food
ar: شراء الطعام بالجملة
de: Lebensmittel in großen Mengen kaufen
es: Comprar comida a granel
fr: Acheter de la nourriture en vrac
it: Comprare cibo sfuso
ja: まとめ買いする
ko: 대량 구매
pt: Comprar comida a granel
ru: Покупать еду оптом
zh: 批量购买食物

source: Compost kitchen waste
ar: تحويل نفايات المطبخ إلى سماد
de: Küchenabfälle kompostieren
es: Compostar residuos de cocina
fr: Composter les déchets de cuisine
it: Compostare i rifiuti della cucina
ja: キッチンの生ごみを堆肥化
ko: 주방 쓰레기 퇴비화
pt: Compostar resíduos da cozinha
ru: Компостировать кухонные отходы
zh: 堆肥厨房垃圾

source: Plant a mini garden
ar: ازرع حديقة صغيرة
de: Mini-Garten anlegen
es: Plantar un mini jardín
fr: Planter un mini jardin
it: Piantare un mini giardino
ja: ミニガーデンを植える
ko: 미니 정원 만들기
pt: Plantar um mini jardim
ru: Посадить мини-сад
zh: 种植迷你花园

source: Reduce packaged food
ar: قلل من الطعام المعبأ
de: Verpackte Lebensmittel reduzieren
es: Reducir comida envasada
fr: Réduire les aliments emballés
it: Ridurre il cibo confezionato
ja: 包装食品を減らす
ko: 포장 식품 줄이기
pt: Reduzir comida embalada
ru: Уменьшить упакованную еду
zh: 减少包装食品

source: Choose seasonal fruits
ar: اختر الفواكه الموسمية
de: Saisonale Früchte wählen
es: Elegir frutas de temporada
fr: Choisir des fruits de saison
it: Scegliere frutta di stagione
ja: 季節の果物を選ぶ
ko: 제철 과일 선택
pt: Escolher frutas da estação
ru: Выбирать сезонные фрукты
zh: 选择时令水果

source: Cold water wash
ar: غسيل بالماء البارد
de: Kaltwasserwäsche
es: Lavado con agua fría
fr: Lavage à l'eau froide
it: Lavaggio a acqua fredda
ja: 冷水洗濯
ko: 냉수 세탁
pt: Lavagem com água fria
ru: Стирка холодной водой
zh: 冷水洗涤
