Repository: abdullah2310ishaq/echohabits
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ja, ko, pt, ru, zh

source: Switch off unused lights
ar: أطفئ الأضواء غير المستخدمة
de: Ungenutzte Lichter ausschalten
es: Apagar luces no utilizadas
fr: Éteindre les lumières inutilisées
it: Spegnere le luci non utilizzate
ja: 使用していない照明を消す
ko: 사용하지 않는 조명 끄기
pt: Desligar luzes não utilizadas
ru: Выключать неиспользуемый свет
zh: 关闭未使用的灯光

source: Use energy-efficient bulbs
ar: استخدم المصابيح الموفرة للطاقة
de: Energiesparende Glühbirnen verwenden
es: Usar bombillas de bajo consumo
fr: Utiliser des ampoules écoénergétiques
it: Usare lampadine a risparmio energetico
ja: 省エネ電球を使用
ko: 절전 전구 사용
pt: Usar lâmpadas de baixo consumo
ru: Использовать энергосберегающие лампы
zh: 使用节能灯泡

source: Air dry clothes
ar: جفف الملابس بالهواء
de: Kleidung an der Luft trocknen
es: Secar la ropa al aire
fr: Sécher les vêtements à l'air
it: Asciugare i vestiti all'aria
ja: 洗濯物を自然乾燥
ko: 공기 건조
pt: Secar roupas ao ar
ru: Сушить одежду на воздухе
zh: 风干衣服

source: Use natural ventilation
ar: استخدم التهوية الطبيعية
de: Natürliche Belüftung nutzen
es: Usar ventilación natural
fr: Utiliser la ventilation naturelle
it: Usare la ventilazione naturale
ja: 自然換気を使用
ko: 자연 환기 사용
pt: Usar ventilação natural
ru: Использовать естественную вентиляцию
zh: 使用自然通风

source: Shorter showers
ar: استحمام أقصر
de: Kürzere Duschen
es: Duchas más cortas
fr: Douches plus courtes
it: Docce più brevi
ja: 短いシャワー
ko: 짧은 샤워
pt: Banhos mais curtos
ru: Более короткий душ
zh: 缩短淋浴时间

source: Fix water leaks
ar: أصلح تسريبات المياه
de: Wasserverluste reparieren
es: Reparar fugas de agua
fr: Réparer les fuites d'eau
it: Riparare le perdite d'acqua
ja: 水漏れを修理
ko: 수도 누수 수리
pt: Corrigir vazamentos de água
ru: Исправить утечки воды
zh: 修复漏水

source: Collect rainwater for plants
ar: اجمع مياه الأمطار للنباتات
de: Regenwasser für Pflanzen sammeln
es: Recoger agua de lluvia para plantas
fr: Collecter l'eau de pluie pour les plantes
it: Raccogliere acqua piovana per le piante
ja: 植物用に雨水を集める
ko: 식물용 빗물 수집
pt: Coletar água da chuva para plantas
ru: Собирать дождевую воду для растений
zh: 收集雨水用于植物

source: Reuse RO water
ar: أعد استخدام مياه التنقية
de: Umkehrosmose-Wasser wiederverwenden
es: Reutilizar agua de ósmosis
fr: Réutiliser l'eau d'osmose inverse
it: Riutilizzare l'acqua ad osmosi inversa
ja: RO水を再利用
ko: RO 물 재사용
pt: Reutilizar água de osmose reversa
ru: Повторно использовать воду обратного осмоса
zh: 重复使用反渗透水

source: Turn off tap while brushing
ar: أغلق الصنبور أثناء تنظيف الأسنان
de: Wasserhahn beim Zähneputzen abstellen
es: Cerrar el grifo al cepillarse
fr: Fermer le robinet pendant le brossage
it: Chiudere il rubinetto durante la spazzolatura
ja: 歯磨き中に蛇口を閉める
ko: 양치질 중 수도꼭지 끄기
pt: Desligar a torneira ao escovar
ru: Выключать кран во время чистки зубов
zh: 刷牙时关闭水龙头

source: Carry reusable bags
ar: احمل أكياس قابلة لإعادة الاستخدام
de: Wiederverwendbare Taschen mitnehmen
es: Llevar bolsas reutilizables
fr: Apporter des sacs réutilisables
it: Portare borse riutilizzabili
ja: 再利用可能なバッグを持参
ko: 재사용 가능한 가방 휴대
pt: Carregar sacolas reutilizáveis
ru: Носить многоразовые сумки
zh: 携带可重复使用的袋子

source: Buy recycled products
ar: اشتري المنتجات المعاد تدويرها
de: Recycelte Produkte kaufen
es: Comprar productos reciclados
fr: Acheter des produits recyclés
it: Comprare prodotti riciclati
ja: リサイクル製品を購入
ko: 재활용 제품 구매
pt: Comprar produtos reciclados
ru: Покупать переработанные продукты
zh: 购买回收产品

source: Avoid fast fashion
ar: تجنب الموضة السريعة
de: Fast Fashion vermeiden
es: Evitar la moda rápida
fr: Éviter la mode rapide
it: Evitare la moda veloce
ja: ファストファッションを避ける
ko: 패스트 패션 피하기
pt: Evitar moda rápida
ru: Избегать быстрой моды
zh: 避免快时尚

source: Choose eco-friendly brands
ar: اختر العلامات التجارية الصديقة للبيئة
de: Umweltfreundliche Marken wählen
es: Elegir marcas ecológicas
fr: Choisir des marques écologiques
it: Scegliere marchi ecologici
ja: エコフレンドリーなブランドを選ぶ
ko: 친환경 브랜드 선택
pt: Escolher marcas ecológicas
ru: Выбирать экологически чистые бренды
zh: 选择环保品牌

source: Support local business
ar: ادعم الأعمال المحلية
de: Lokale Unternehmen unterstützen
es: Apoyar negocios locales
fr: Soutenir les entreprises locales
it: Supportare le attività locali
ja: 地元のビジネスを支援
ko: 지역 비즈니스 지원
pt: Apoiar negócios locais
ru: Поддерживать местный бизнес
zh: 支持本地企业

source: Reduce screen time
ar: قلل وقت الشاشة
de: Bildschirmzeit reduzieren
es: Reducir tiempo de pantalla
fr: Réduire le temps d'écran
it: Ridurre il tempo davanti allo schermo
ja: 画面時間を減らす
ko: 화면 시간 줄이기
pt: Reduzir tempo de tela
ru: Уменьшить время перед экраном
zh: 减少屏幕时间

source: Unsubscribe unwanted mails
ar: ألغ الاشتراك في الرسائل غير المرغوب فيها
de: Von unerwünschten E-Mails abmelden
es: Cancelar suscripción de correos no deseados
fr: Se désabonner des courriers indésirables
it: Disiscriversi dalle email indesiderate
ja: 不要なメールの配信を停止
ko: 원하지 않는 메일 구독 취소
pt: Cancelar inscrição de e-mails indesejados
ru: Отписаться от нежелательных писем
zh: 取消订阅不需要的邮件

source: Cloud backup cleanup
ar: تنظيف النسخ الاحتياطي السحابي
de: Cloud-Backup bereinigen
es: Limpieza de respaldo en la nube
fr: Nettoyage de sauvegarde cloud
it: Pulizia backup cloud
ja: クラウドバックアップのクリーンアップ
ko: 클라우드 백업 정리
pt: Limpeza de backup na nuvem
ru: Очистка облачного резервного копирования
zh: 清理云备份

source: Turn off auto-play
ar: أطفئ التشغيل التلقائي
de: Automatische Wiedergabe ausschalten
es: Desactivar reproducción automática
fr: Désactiver la lecture automatique
it: Disattivare la riproduzione automatica
ja: 自動再生をオフにする
ko: 자동 재생 끄기
pt: Desativar reprodução automática
ru: Выключить автовоспроизведение
zh: 关闭自动播放

source: Digital mindful breaks
ar: استراحات رقمية واعية
de: Digitale achtsame Pausen
es: Descansos conscientes digitales
fr: Pauses numériques conscientes
it: Pause digitali consapevoli
ja: デジタルマインドフルブレーク
ko: 디지털 마음챙김 휴식
pt: Pausas digitais conscientes
ru: Цифровые осознанные перерывы
zh: 数字正念休息

source: Morning walk
ar: نزهة صباحية
de: Morgenspaziergang
es: Caminata matutina
fr: Marche matinale
it: Passeggiata mattutina
ja: 朝の散歩
ko: 아침 산책
pt: Caminhada matinal
ru: Утренняя прогулка
zh: 晨间散步

source: Practice yoga
ar: مارس اليوغا
de: Yoga praktizieren
es: Practicar yoga
fr: Pratiquer le yoga
it: Praticare yoga
ja: ヨガを練習
ko: 요가 연습
pt: Praticar yoga
ru: Заниматься йогой
zh: 练习瑜伽

source: Healthy sleep routine
ar: روتين نوم صحي
de: Gesunde Schlafroutine
es: Rutina de sueño saludable
fr: Routine de sommeil saine
it: Routine di sonno sana
ja: 健康的な睡眠習慣
ko: 건강한 수면 습관
pt: Rotina de sono saudável
ru: Здоровый режим сна
zh: 健康的睡眠习惯

source: Drink 2L water
ar: اشرب 2 لتر من الماء
de: 2L Wasser trinken
es: Beber 2L de agua
fr: Boire 2L d'eau
it: Bere 2L di acqua
ja: 2リットルの水を飲む
ko: 물 2L 마시기
pt: Beber 2L de água
ru: Пить 2л воды
zh: 喝2升水

source: Avoid junk snacks
ar: تجنب الوجبات الخفيفة غير الصحية
de: Ungesunde Snacks vermeiden
es: Evitar snacks chatarra
fr: Éviter les snacks malsains
it: Evitare snack spazzatura
ja: ジャンクスナックを避ける
ko: 불량 스낵 피하기
pt: Evitar lanches não saudáveis
ru: Избегать вредных закусок
zh: 避免垃圾零食

source: Meditation 5 min/day
ar: تأمل 5 دقائق/يوم
de: Meditation 5 Min/Tag
es: Meditación 5 min/día
fr: Méditation 5 min/jour
it: Meditazione 5 min/giorno
ja: 瞑想5分/日
ko: 명상 5분/일
pt: Meditação 5 min/dia
ru: Медитация 5 мин/день
zh: 冥想5分钟/天

source: Practice gratitude journaling
ar: مارس تدوين الامتنان
de: Dankbarkeitstagebuch führen
es: Practicar diario de gratitud
fr: Pratiquer le journal de gratitude
it: Praticare il diario della gratitudine
ja: 感謝の日記を書く
ko: 감사 일기 쓰기
pt: Praticar diário de gratidão
ru: Вести дневник благодарности
zh: 练习感恩日记

source: Breathing exercise
ar: تمرين التنفس
de: Atemübung
es: Ejercicio de respiración
fr: Exercice de respiration
it: Esercizio di respirazione
ja: 呼吸法
ko: 호흡 운동
pt: Exercício de respiração
ru: Дыхательное упражнение
zh: 呼吸练习

source: Spend time in nature
ar: اقضِ وقتاً في الطبيعة
de: Zeit in der Natur verbringen
es: Pasar tiempo en la naturaleza
fr: Passer du temps dans la nature
it: Passare del tempo nella natura
ja: 自然の中で過ごす
ko: 자연 속에서 시간 보내기
pt: Passar tempo na natureza
ru: Проводить время на природе
zh: 在大自然中度过时光

source: Limit negative news
ar: قلل الأخبار السلبية
de: Negative Nachrichten begrenzen
es: Limitar noticias negativas
fr: Limiter les nouvelles négatives
it: Limitare le notizie negative
ja: ネガティブなニュースを制限
ko: 부정적인 뉴스 제한
pt: Limitar notícias negativas
ru: Ограничить негативные новости
zh: 限制负面新闻

source: Track expenses
ar: تتبع المصروفات
de: Ausgaben verfolgen
es: Rastrear gastos
fr: Suivre les dépenses
it: Tracciare le spese
ja: 支出を追跡
ko: 지출 추적
pt: Rastrear despesas
ru: Отслеживать расходы
zh: 追踪支出

source: Monthly savings goal
ar: هدف التوفير الشهري
de: Monatliches Sparziel
es: Meta de ahorro mensual
fr: Objectif d'épargne mensuel
it: Obiettivo di risparmio mensile
ja: 月間貯蓄目標
ko: 월간 저축 목표
pt: Meta de economia mensal
ru: Ежемесячная цель сбережений
zh: 月度储蓄目标

source: Avoid impulse buying
ar: تجنب الشراء الاندفاعي
de: Impulskäufe vermeiden
es: Evitar compras impulsivas
fr: Éviter les achats impulsifs
it: Evitare acquisti impulsivi
ja: 衝動買いを避ける
ko: 충동 구매 피하기
pt: Evitar compras impulsivas
ru: Избегать импульсивных покупок
zh: 避免冲动购买

source: Invest in SIP
ar: استثمر في SIP
de: In SIP investieren
es: Invertir en SIP
fr: Investir dans un SIP
it: Investire in SIP
ja: SIPに投資
ko: SIP 투자
pt: Investir em SIP
ru: Инвестировать в SIP
zh: 投资SIP

source: Use cash-back responsibly
ar: استخدم استرداد النقود بمسؤولية
de: Cash-Back verantwortungsvoll nutzen
es: Usar cash-back responsablemente
fr: Utiliser le cash-back de manière responsable
it: Usare il cash-back responsabilmente
ja: キャッシュバックを責任を持って使用
ko: 캐시백 책임감 있게 사용
pt: Usar cash-back de forma responsável
ru: Использовать кэшбэк ответственно
zh: 负责任地使用返现

# defaultWalkBikeTitle
source: Walked/ biked instead of driving
ar: المشي/الدراجة بدلاً من القيادة
de: Zu Fuß gegangen/mit dem Fahrrad gefahren statt Auto zu fahren
es: Caminaste o fuiste en bicicleta en lugar de conducir
fr: Vous avez marché ou pris le vélo au lieu de conduire
it: Hai camminato o usato la bici invece di guidare
ja: 車ではなく歩く／自転車を利用した
ko: 운전 대신 걷거나 자전거를 이용함
ru: Ходил пешком/ездил на велосипеде вместо того, чтобы ехать на машине
zh: 步行/骑行替代开车

# defaultCoffeeCupTitle
source: Used a reusable coffee cup
ar: استخدم كوب قهوة قابل لإعادة الاستخدام
de: Einen wiederverwendbaren Kaffeebecher benutzt
es: Usaste una taza de café reutilizable
fr: Vous avez utilisé une tasse à café réutilisable
it: Hai usato una tazza da caffè riutilizzabile
ja: 再利用できるコーヒーカップを使った
ko: 재사용 가능한 커피컵을 사용함
ru: Использовал многоразовый кофейный стакан
zh: 使用了可重复使用的咖啡杯

# defaultAfforestationTitle
source: Afforestation / Plant a tree for better environment
ar: إعادة التحريج / ازرع شجرة لبيئة أفضل
de: Aufforstung / Einen Baum für eine bessere Umwelt gepflanzt
es: Reforestación / Plantar un árbol para un mejor medio ambiente
fr: Reboisement / Planté un arbre pour un meilleur environnement
it: Rimboschimento / Hai piantato un albero per un ambiente migliore
ja: 植林／より良い環境のために木を植えた
ko: 조림 / 더 나은 환경을 위해 나무를 심음
ru: Лесовосстановление / Посадил дерево ради лучшей экологии
zh: 造林 / 为更好的环境种下一棵树

# dailyTag
source: Daily
ar: يومي
de: Täglich
es: Diario
fr: Quotidien
it: Quotidiano
ja: 毎日
ko: 매일
ru: Ежедневно
zh: 每日

# afforestationTag
source: Afforestation
ar: إعادة التحريج
de: Aufforstung
es: Reforestación
fr: Reboisement
it: Rimboschimento
ja: 植林
ko: 조림
ru: Лесовосстановление
zh: 造林

# plantingTag
source: Planting
ar: الزراعة
de: Pflanzen
es: Plantación
fr: Plantation
it: Piantagione
ja: 植樹
ko: 식재
ru: Посадка
zh: 植树

# onboardingTitle1
source: Track Your Daily Eco Actions
ar: تتبع إجراءاتك البيئية اليومية
de: Verfolgen Sie Ihre täglichen Öko-Aktionen
es: Rastrea tus Acciones Ecológicas Diarias
fr: Suivez vos Actions Écologiques Quotidiennes
it: Traccia le tue Azioni Ecologiche Giornaliere
ja: 毎日のエコアクションを追跡
ko: 일일 에코 액션 추적
zh: 追踪您的每日生态行动

# onboardingDescription1
source: Complete daily actions, maintain your streak, and increase your eco score.
ar: أكمل الإجراءات اليومية، حافظ على سلسلتك وزد نقاطك البيئية.
de: Vervollständigen Sie tägliche Aktionen, halten Sie Ihre Serie aufrecht und erhöhen Sie Ihren Öko-Score.
es: Completa acciones diarias, mantén tu racha y aumenta tu puntuación ecológica.
fr: Complétez des actions quotidiennes, maintenez votre série et augmentez votre score écologique.
it: Completa azioni quotidiane, mantieni la tua serie e aumenta il tuo punteggio ecologico.
ja: 毎日のアクションを完了し、連続記録を維持し、エコスコアを上げましょう。
ko: 일일 액션을 완료하고, 연속 기록을 유지하며, 에코 점수를 높이세요.
zh: 完成每日行动，保持您的连续记录，并提高您的生态分数。

# onboardingTitle2
source: Build Habits That Stick
ar: بناء عادات تبقى
de: Gewohnheiten aufbauen, die bleiben
es: Construye Hábitos que Perduren
fr: Construisez des Habitudes qui Restent
it: Costruisci Abitudini che Restano
ja: 定着する習慣を構築
ko: 지속되는 습관 구축
zh: 建立持久的习惯

# onboardingDescription2
source: Add habits to your routine, maintain streaks, and earn rewards as you stay consistent.
ar: أضف عادات إلى روتينك، حافظ على السلاسل واكسب المكافآت مع الحفاظ على الاتساق.
de: Fügen Sie Gewohnheiten zu Ihrer Routine hinzu, halten Sie Serien aufrecht und verdienen Sie Belohnungen, während Sie konsequent bleiben.
es: Añade hábitos a tu rutina, mantén rachas y gana recompensas mientras te mantienes constante.
fr: Ajoutez des habitudes à votre routine, maintenez des séries et gagnez des récompenses en restant constant.
it: Aggiungi abitudini alla tua routine, mantieni le serie e guadagna ricompense rimanendo costante.
ja: ルーティンに習慣を追加し、連続記録を維持し、一貫性を保つことで報酬を獲得しましょう。
ko: 루틴에 습관을 추가하고, 연속 기록을 유지하며, 일관성을 유지하면서 보상을 받으세요.
zh: 将习惯添加到您的日常中，保持连续记录，并在保持一致性的同时获得奖励。

# onboardingTitle3
source: Compete. Earn. Level Up.
ar: تنافس. اكسب. تقدم.
de: Wettbewerb. Verdienen. Aufsteigen.
es: Compite. Gana. Sube de Nivel.
fr: Rivalisez. Gagnez. Montez de Niveau.
it: Competi. Guadagna. Sali di Livello.
ja: 競争。獲得。レベルアップ。
ko: 경쟁. 획득. 레벨업.
zh: 竞争。获得。升级。

# onboardingDescription3
source: Climb the leaderboard, unlock badges, and track your progress against others.
ar: تسلق لوحة المتصدرين، افتح الشارات وتتبع تقدمك مقارنة بالآخرين.
de: Steigen Sie in der Bestenliste auf, schalten Sie Abzeichen frei und verfolgen Sie Ihren Fortschritt im Vergleich zu anderen.
es: Sube en la clasificación, desbloquea insignias y rastrea tu progreso contra otros.
fr: Grimpez dans le classement, débloquez des badges et suivez votre progression par rapport aux autres.
it: Scala la classifica, sblocca badge e traccia i tuoi progressi rispetto agli altri.
ja: リーダーボードを登り、バッジを解除し、他の人との進捗を追跡しましょう。
ko: 리더보드를 오르고, 배지를 잠금 해제하고, 다른 사람들과의 진행 상황을 추적하세요.
zh: 攀登排行榜，解锁徽章，并追踪您与他人的进度。
